In [1]:
import pandas as pd
import numpy as np

In [96]:
test_data = (np.arange(1,10*2+1)*10).reshape(2,10) #numpy배열로 10~90까지 데이터 생성

In [100]:
index_date = pd.date_range('2019-09-01', periods = 2) #시작일부터 4개의 기간을 만듬
# columns_list = ['A', 'B', 'C'] #columns 데이터 ABC

df_test = pd.DataFrame(test_data, index = index_date, columns = columns_list) #test_data를 dataFrame type으로 만듬.

In [101]:
df_test = pd.DataFrame(test_data, index = index_date) #test_data를 dataFrame type으로 만듬.

###  type(df_test)
 pandas.core.frame.DataFrame

In [102]:
df_test

              0    1    2    3    4    5    6    7    8    9
2019-09-01   10   20   30   40   50   60   70   80   90  100
2019-09-02  110  120  130  140  150  160  170  180  190  200

#### 딕셔너리 타입으로 DataFrame만들기

In [2]:
table_data = {
    '연도':[2015, 2016, 2017, 2018, 2019],
    '지사':['한국1', '한국2', '미국', '일본', '중국'],
    '고객 수':['200', '300', '1200', '200', '1500']
             }

index_date2 = pd.date_range('2019-05-06', periods = 5, freq = 'MS')

In [4]:
pd.DataFrame(table_data)

     연도   지사  고객 수
0  2015  한국1   200
1  2016  한국2   300
2  2017   미국  1200
3  2018   일본   200
4  2019   중국  1500

딕셔너리의 key는 columns가 되고, index는 자동으로 생성되었다. 

key에 대응하는 values는 데이터가 되었다.

In [54]:
df_test2 = pd.DataFrame(table_data, index=index_date2) #index 추가

In [55]:
df_test2

              연도   지사  고객 수
2019-06-01  2015  한국1   200
2019-07-01  2016  한국2   300
2019-08-01  2017   미국  1200
2019-09-01  2018   일본   200
2019-10-01  2019   중국  1500

In [56]:
df_test2.index

DatetimeIndex(['2019-06-01', '2019-07-01', '2019-08-01', '2019-09-01',
               '2019-10-01'],
              dtype='datetime64[ns]', freq='MS')

In [57]:
df_test2.columns

Index(['연도', '지사', '고객 수'], dtype='object')

In [58]:
df_test2.values

array([[2015, '한국1', '200'],
       [2016, '한국2', '300'],
       [2017, '미국', '1200'],
       [2018, '일본', '200'],
       [2019, '중국', '1500']], dtype=object)

Pandas series

In [5]:
test_data2 = np.arange(10)**2-4

In [6]:
series1 = pd.Series(test_data2).T

In [10]:
series1

0    -4
1    -3
2     0
3     5
4    12
5    21
6    32
7    45
8    60
9    77
dtype: int32

In [9]:
type(series1)

pandas.core.series.Series

# series와 dataframe 연산

In [93]:
series1

0    -4
1    -3
2     0
3     5
4    12
5    21
6    32
7    45
8    60
9    77
dtype: int32

In [94]:
type(series1)

pandas.core.series.Series

In [103]:
df_test

              0    1    2    3    4    5    6    7    8    9
2019-09-01   10   20   30   40   50   60   70   80   90  100
2019-09-02  110  120  130  140  150  160  170  180  190  200

In [104]:
series1+df_test  # series의 각 행에 해당하는 값이 계산됨.

              0    1    2    3    4    5    6    7    8    9
2019-09-01    6   17   30   45   62   81  102  125  150  177
2019-09-02  106  117  130  145  162  181  202  225  250  277

# 통계함수 사용하기

In [126]:
table_data3 = {
    '봄':[123,345,456,567,678],
    '여름':[345,236,1234,4586,547],
    '가을':[856,345,772,245,122],
    '겨울':[134,6456,212,423,747]
}

date1 = np.arange(5)+2012

df3 = pd.DataFrame(table_data3, index = date1)

In [127]:
df3

        봄    여름   가을    겨울
2012  123   345  856   134
2013  345   236  345  6456
2014  456  1234  772   212
2015  567  4586  245   423
2016  678   547  122   747

# 열별 통계함수를 구한다. 
### default : axis =0

In [128]:
df3.mean()

봄      433.8
여름    1389.6
가을     468.0
겨울    1594.4
dtype: float64

In [129]:
df3.sum()

봄     2169
여름    6948
가을    2340
겨울    7972
dtype: int64

In [130]:
df3.std()

봄      213.512763
여름    1828.465285
가을     326.930421
겨울    2728.058705
dtype: float64

In [131]:
df3.var()

봄       45587.7
여름    3343285.3
가을     106883.5
겨울    7442304.3
dtype: float64

In [133]:
df3.cumsum()

         봄    여름    가을    겨울
2012   123   345   856   134
2013   468   581  1201  6590
2014   924  1815  1973  6802
2015  1491  6401  2218  7225
2016  2169  6948  2340  7972

## axis 파라미터를 1로 할 경우 행별로 연산한다.

In [134]:
df3.sum(axis=1)

2012    1458
2013    7382
2014    2674
2015    5821
2016    2094
dtype: int64

###  통계수치 종합 선물세트는 .describe()

In [140]:
df3.describe()

                봄           여름          가을           겨울
count    5.000000     5.000000    5.000000     5.000000
mean   433.800000  1389.600000  468.000000  1594.400000
std    213.512763  1828.465285  326.930421  2728.058705
min    123.000000   236.000000  122.000000   134.000000
25%    345.000000   345.000000  245.000000   212.000000
50%    456.000000   547.000000  345.000000   423.000000
75%    567.000000  1234.000000  772.000000   747.000000
max    678.000000  4586.000000  856.000000  6456.000000

## 데이터를 원하는 대로 선택하기 (feat. KTX 이용자수 데이터)

In [6]:
KTX_data = {
    '경부선' : [39060, 39896, 42005, 43621, 41702, 41266, 32427],
    '호남선' : [7313, 6967, 6873, 6626, 8675, 10622, 9228],
    '경전선' : [3627, 4168, 4088, 4424, 4606, 4984, 5570],
    '전라선' : [309, 1771, 1954, 2244, 3146, 3945, 5766],
    '동해선' : [np.nan, np.nan, np.nan, np.nan, 2395, 3786, 6667]
}
col_list = ['경부선', '호남선', '경전선', '전라선', '동해선']
index_list = np.arange(2011, 2018).astype(str)
list(index_list)

SyntaxError: invalid syntax (<ipython-input-6-5f04e0bb27ed>, line 6)

In [4]:
df_KTX = pd.DataFrame(KTX_data, columns = col_list, index=index_list)

In [5]:
df_KTX

        경부선    호남선   경전선   전라선     동해선
2011  39060   7313  3627   309     NaN
2012  39896   6967  4168  1771     NaN
2013  42005   6873  4088  1954     NaN
2014  43621   6626  4424  2244     NaN
2015  41702   8675  4606  3146  2395.0
2016  41266  10622  4984  3945  3786.0
2017  32427   9228  5570  5766  6667.0

In [9]:
df_KTX.values

array([[39060.,  7313.,  3627.,   309.,    nan],
       [39896.,  6967.,  4168.,  1771.,    nan],
       [42005.,  6873.,  4088.,  1954.,    nan],
       [43621.,  6626.,  4424.,  2244.,    nan],
       [41702.,  8675.,  4606.,  3146.,  2395.],
       [41266., 10622.,  4984.,  3945.,  3786.],
       [32427.,  9228.,  5570.,  5766.,  6667.]])

In [10]:
df_KTX.index

Index(['2011', '2012', '2013', '2014', '2015', '2016', '2017'], dtype='object')

In [11]:
df_KTX.columns

Index(['경부선', '호남선', '경전선', '전라선', '동해선'], dtype='object')

In [12]:
df_KTX.head() #앞부터 n행을 보여준다. default is 5

        경부선   호남선   경전선   전라선     동해선
2011  39060  7313  3627   309     NaN
2012  39896  6967  4168  1771     NaN
2013  42005  6873  4088  1954     NaN
2014  43621  6626  4424  2244     NaN
2015  41702  8675  4606  3146  2395.0

In [13]:
df_KTX.tail()

        경부선    호남선   경전선   전라선     동해선
2013  42005   6873  4088  1954     NaN
2014  43621   6626  4424  2244     NaN
2015  41702   8675  4606  3146  2395.0
2016  41266  10622  4984  3945  3786.0
2017  32427   9228  5570  5766  6667.0

In [14]:
df_KTX[1:4] #원하는 행만 볼 수 있음

        경부선   호남선   경전선   전라선  동해선
2012  39896  6967  4168  1771  NaN
2013  42005  6873  4088  1954  NaN
2014  43621  6626  4424  2244  NaN

In [19]:
df_KTX.loc['2012': '2015'] #원하는 index 영역을 지정가능

        경부선   호남선   경전선   전라선     동해선
2012  39896  6967  4168  1771     NaN
2013  42005  6873  4088  1954     NaN
2014  43621  6626  4424  2244     NaN
2015  41702  8675  4606  3146  2395.0

In [24]:
df_KTX['경부선'] #원하는 column 추출

2011    39060
2012    39896
2013    42005
2014    43621
2015    41702
2016    41266
2017    32427
Name: 경부선, dtype: int64

In [25]:
df_KTX['경부선']['2011':'2013'] #원하는 column과 index 추출

2011    39060
2012    39896
2013    42005
Name: 경부선, dtype: int64

In [30]:
df_KTX['경부선'][0:3]  #위와 같은 표현

2011    39060
2012    39896
2013    42005
Name: 경부선, dtype: int64

In [31]:
df_KTX['경부선']['2016']

41266

#### 데이터 전치(Transpose)

In [32]:
df_KTX.T

        2011     2012     2013     2014     2015     2016     2017
경부선  39060.0  39896.0  42005.0  43621.0  41702.0  41266.0  32427.0
호남선   7313.0   6967.0   6873.0   6626.0   8675.0  10622.0   9228.0
경전선   3627.0   4168.0   4088.0   4424.0   4606.0   4984.0   5570.0
전라선    309.0   1771.0   1954.0   2244.0   3146.0   3945.0   5766.0
동해선      NaN      NaN      NaN      NaN   2395.0   3786.0   6667.0

In [33]:
df_KTX

        경부선    호남선   경전선   전라선     동해선
2011  39060   7313  3627   309     NaN
2012  39896   6967  4168  1771     NaN
2013  42005   6873  4088  1954     NaN
2014  43621   6626  4424  2244     NaN
2015  41702   8675  4606  3146  2395.0
2016  41266  10622  4984  3945  3786.0
2017  32427   9228  5570  5766  6667.0

## 데이터 통합하기

#### 세로방향으로 통합

In [34]:
df1 = pd.DataFrame({
    'Class1' : [95,92, 98, 100],
    'Class2' : [91, 93, 95, 99]
})

In [35]:
df1

   Class1  Class2
0      95      91
1      92      93
2      98      95
3     100      99

In [36]:
df2 = pd.DataFrame({
    'Class1' : [93, 20],
    'Class2' : [23, 40]
    
})

In [37]:
df2

   Class1  Class2
0      93      23
1      20      40

In [38]:
df1.append(df2)

   Class1  Class2
0      95      91
1      92      93
2      98      95
3     100      99
0      93      23
1      20      40

In [43]:
df2

   Class1  Class2
0      93      23
1      20      40

In [44]:
df1

   Class1  Class2
0      95      91
1      92      93
2      98      95
3     100      99

In [41]:
df3 = df1.append(df2, ignore_index=True)

In [42]:
df3

   Class1  Class2
0      95      91
1      92      93
2      98      95
3     100      99
4      93      23
5      20      40

In [46]:
df4 = pd.DataFrame({
    'Class1' : [90, 90, 48]
})

In [48]:
df3.append(df4, ignore_index=True)

   Class1  Class2
0      95    91.0
1      92    93.0
2      98    95.0
3     100    99.0
4      93    23.0
5      20    40.0
6      90     NaN
7      90     NaN
8      48     NaN

===================================================================
#### 가로 방향으로 통합

In [52]:
df5 = pd.DataFrame({
    'Class3' : [95,92, 98, 100]
})

In [53]:
df1.join(df5)

   Class1  Class2  Class3
0      95      91      95
1      92      93      92
2      98      95      98
3     100      99     100

In [54]:
df6 = pd.DataFrame({
    'Class4' : [12, 34]
})

In [55]:
df1.join(df6)

   Class1  Class2  Class4
0      95      91    12.0
1      92      93    34.0
2      98      95     NaN
3     100      99     NaN

# 데이터 읽어오기

In [95]:
%%writefile C:\myPyCode\data\sea_rain1.csv
    연도, 동해,남해,서해,전체
    1996,17.1234,17.3453,18.234,18.234
    1997,12.4234,12.3434,52.234,53.66
    1998,17.5944, 18.011,15.2512,16.6044
    1999,18.1495,18.3175,14.8979,16.6284
    2000,17.9288,18.1766,15.0504,16.6178

Overwriting C:\myPyCode\data\sea_rain1.csv

### 주의
<index_col=> 파라미터의 인자는 column의 이름이 아니라 index번호가 들어가야 한다!!! 책이랑 달라졌음..--

In [97]:
read1 = pd.read_csv('C:\myPyCode\data\sea_rain1.csv', encoding = "UTF-8", sep=",", index_col=0 ) 
#enconding에 맞게 해줘야 한글이 잘 나옴. cp949로 된 파일 이면 encoding="cp949를 해야함."

In [98]:
type(read1)

pandas.core.frame.DataFrame

In [99]:
%%writefile C:\myPyCode\data\sample_1.csv
    index,Weight,Height
    ID_1, 62, 165
    ID_2, 67, 177
    ID_3, 55, 160
    ID_4, 74, 180

Writing C:\myPyCode\data\sample_1.csv

In [116]:
df_WH = pd.read_csv('C:\myPyCode\data\sample_1.csv', index_col=0, sep=", ")
df_WH.index.name = 'User'

C:\Users\gyul6\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  """Entry point for launching an IPython kernel.

In [117]:
df_WH.columns

Index(['Weight', 'Height'], dtype='object')

In [119]:
bmi = df_WH['Weight']/(df_WH['Height']/100)**2
bmi

User
ID_1    22.773186
ID_2    21.385936
ID_3    21.484375
ID_4    22.839506
dtype: float64

In [120]:
df_WH['BMI'] = bmi
df_WH

      Weight  Height        BMI
User
ID_1      62     165  22.773186
ID_2      67     177  21.385936
ID_3      55     160  21.484375
ID_4      74     180  22.839506

In [124]:
#csv로 저장하기
df_WH.to_csv('C:\myPyCode\data\save_DataFrame.csv')

In [122]:
!type C:\myPyCode\data\save_DataFrame.csv

User,Weight,Height,BMI
ID_1,62,165,22.77318640955005
ID_2,67,177,21.38593635289987
ID_3,55,160,21.484374999999996
ID_4,74,180,22.839506172839506

In [125]:
%%writefile C:\myPyCode\data\save_DataFrame_cp949.txt
    index,판매가격,판매량
    P1001,2000,32
    P1002,3000,53
    P1003,5000,40
    P1004,10000,25

Writing C:\myPyCode\data\save_DataFrame_cp949.txt

In [128]:
df_pr = pd.read_csv('C:\myPyCode\data\save_DataFrame_cp949.txt', index_col=0)
df_pr.index.name = '제품번호'
df_pr

            판매가격  판매량
제품번호
    P1001   2000   32
    P1002   3000   53
    P1003   5000   40
    P1004  10000   25

In [130]:
file_name = 'C:\myPyCode\data\save_DataFrame_cp949.txt'
df_pr.to_csv(file_name, sep=" ", encoding='cp949')

In [131]:
!type C:\myPyCode\data\save_DataFrame_cp949.txt

제품번호 판매가격 판매량
"    P1001" 2000 32
"    P1002" 3000 53
"    P1003" 5000 40
"    P1004" 10000 25